[{"text": "THIS IS A TEMPORARY DATABASE.\n\nIt will disappear when you close the application. This database contains a few documents and labels to allow trying out labelbuddy. You can create annotations, import more documents and labels and export annotations, but the database itself will be removed when labelbuddy exits.\n\n(You don't have to actually read this text, try annotating it instead!)\n\nIf you decide to start a real project you want to keep, from the File menu select \"New\" and choose a location on your filesystem to create a persistent database. You can also close labelbuddy and open it again and by default it will open a database in your home directory: ~/labelbuddy_data.sqlite3.\n\nTime to start annotating documents! Select some text with the mouse and click on one of the labels on the left to annotate it.\n\nOnce you have made annotations you can select any of them by clicking it. It becomes underlined and bold and you can then change its label or remove it.\n\nIf you create a new annotation that overlaps with a previously existing one, the existing one is automatically removed.\n\nAnnotations are inserted in the database as you create them so there is no need for a \"Save\" button.\n\nOnce you are done annotating this document, you can click \"Next\" above to move on to another one.\n\nThe next document is the labelbuddy documentation, and then a few extracts from Wikipedia (https://en.wikipedia.org/wiki/Main_Page) to illustrate using labelbuddy with different languages and writing systems. The documentation in HTML format can be seen by clicking \"Help\" > \"Documentation\".\n\nTo see the list of documents, remove documents or labels, or change the labels' colors, go to the \"Dataset\" tab.\n\nTo export your annotations or import more documents or labels, go to the \"Import / Export\" tab.\n\n\nHere is a summary of the keybindings available in this page:\n\nCtrl and scroll the mouse: zoom or dezoom the text\nCtrl+F, /: search\nEnter: next search match\nShift+Enter: previous search match\nCtrl+J, Ctrl+N, Down: scroll down one line\nCtrl+K, Ctrl+P, Up: scroll up one line\nCtrl+D: scroll down one page\nCtrl+U: scroll up one page\nCtrl+L: cycle between placing the cursor at the center, top and bottom of the\na-z (label’s shortcut_key): set corresponding label for the currently selected region or annotation\nBackspace: remove selected annotation\nSpace: jump to next annotation and select it\nShift+Space: jump to previous annotation and select it\nEsc: un-select selected annotation\n]: move the end of the selection by one word to the right\n[: move the end of the selection by one word to the left\n}: move the beginning of the selection by one word to the right\n{: move the beginning of the selection by one word to the left\nCtrl+]: move the end of the selection by one character to the right\nCtrl+[: move the end of the selection by one character to the left\nCtrl+}: move the beginning of the selection by one character to the right\nCtrl+{: move the beginning of the selection by one character to the left\n>: go to next document\n<: go to previous document\n", "meta": {"title": "hello_annotations.txt", "md5": "688b2b588edebecfb567a703453de2e3"}, "short_title": "Welcome to labelbuddy demo!", "long_title": "Welcome to labelbuddy demo!"}, {"text": "\nThis doc is better read with a fixed width font: Preferences > monospace, or Help > documentation for html version\n\nlabelbuddy documentation\n\nJérôme Dockès\njerome@dockes.org\n\nTable of Contents\n\n-   1. Introduction\n    -   1.1. labelbuddy vs other annotation tools\n    -   1.2. Quick start\n-   2. Using labelbuddy\n    -   2.1. Importing documents\n    -   2.2. Importing labels\n    -   2.3. Annotating documents\n    -   2.4. Exporting annotations\n    -   2.5. Exporting labels\n    -   2.6. Importing annotations\n    -   2.7. Managing projects\n    -   2.8. Command-line interface\n-   3. Conclusion\n\nThis document describes labelbuddy version 0.0.3.\n\n1. Introduction\n\nlabelbuddy is an open-source desktop GUI application for annotating\ndocuments. It can be used for example for Part Of Speech tagging, Named\nEntity Recognition, sentiment analysis and document classification …\n\nIt aims to be easy to install and use, and can efficiently handle many\ndocuments, labels and annotations.\n\n1.1. labelbuddy vs other annotation tools\n\nThere exist several tools for annotating documents. Most of them, such\nas doccano and labelstudio are meant to run on a web server and be used\nonline. If you are crowdsourcing annotations and want many users to\ncontribute annotations to a central database without installing anything\non their machine you should turn to one of these tools.\n\nHowever if you do not plan to host such a tool on a server, it may not\nbe convenient for each annotator to install one of these rather complex\nprograms and run a local server and database management system on their\nown machine in order to annotate documents. In this case, it may be\neasier to rely on a desktop application such as labelbuddy, which is a\nmore lightweight solution.\n\nlabelbuddy supports the input and output formats of doccano so it is\npossible to switch from one to the other or to combine the work of\nannotators that use either.\n\n1.2. Quick start\n\nStart by installing labelbuddy. Then to give it a try, you can start\nlabelbuddy and open a (temporary) demo database by invoking it as:\n\n    labelbuddy --demo\n\n(You can also start labelbuddy without any options and then select\nFile › Demo in the GUI.) You can play around with labelbuddy’s features\nin this temporary database. If you decide to start creating annotations\nthat you want to keep, open a new database and import your documents and\nlabels.\n\n+-----------------------------------+-----------------------------------+\n| Note                              | a labelbuddy database is actually |\n|                                   | just a regular file on your disk  |\n|                                   | (an SQLite database).             |\n+-----------------------------------+-----------------------------------+\n\n2. Using labelbuddy\n\nDocuments and labels can be imported into a labelbuddy database from\nvarious formats. Once this is done, you can annotate the documents and\nfinally export your annotations. It is also possible to import\nannotations exported from labelbuddy or doccano. Importing and exporting\ndata can be done from the graphical or the command line interface.\n\nDocuments and labels that are already in the database are skipped if you\ntry to import them again.\n\n2.1. Importing documents\n\nIn the “Import / Export” tab, click Import docs & annotations and select\na file.\n\nWhen importing a new document into labelbuddy, several attributes can be\nspecified (exactly how will depend on the format used as described in\nthe following sections):\n\n  ------ ------------------------------------------\n  text   the content of the document – mandatory.\n  ------ ------------------------------------------\n\nAll other attributes are optional:\n\n+-----------------------------------+-----------------------------------+\n| meta                              | a mapping of user-defined         |\n|                                   | metadata. You can use it to       |\n|                                   | associate some information with   |\n|                                   | the document, for example an      |\n|                                   | identifier, DOI, author… This    |\n|                                   | data is not used by labelbuddy.   |\n|                                   | It is stored and bundled with the |\n|                                   | document when you export it.      |\n+-----------------------------------+-----------------------------------+\n| short_title                       | displayed in the “Annotate” tab   |\n|                                   | when annotating the document.     |\n+-----------------------------------+-----------------------------------+\n| long_title                        | displayed in the document list in |\n|                                   | the “Dataset” tab                 |\n+-----------------------------------+-----------------------------------+\n| title                             | -   displayed in the “Annotate”   |\n|                                   |     tab if short_title is missing |\n|                                   |     (if both are missing nothing  |\n|                                   |     is displayed).                |\n|                                   |                                   |\n|                                   | -   displayed in the “Dataset”    |\n|                                   |     tab if long_title is missing  |\n|                                   |     (if both are missing the      |\n|                                   |     beginning of text is          |\n|                                   |     displayed).                   |\n+-----------------------------------+-----------------------------------+\n\n+-----------------------------------+-----------------------------------+\n| Tip                               | You can use the short_title to    |\n|                                   | display essential metadata or     |\n|                                   | short instructions specific to a  |\n|                                   | document. It can contain links by |\n|                                   | using an html <a> tag.            |\n+-----------------------------------+-----------------------------------+\n\nThis information can be provided in several plain text formats. The\nformat is deduced from the filename extension.\n\n2.1.1. From .txt\n\nThe simplest format you can use is a .txt. In this case, the file must\ncontain the text of one document per line. The newlines that separate\ndocuments are not considered part of the document and are discarded.\n\nWhile convenient, this format has some limitations: you cannot specify\nany other document attributes than the text, and the documents cannot\ncontain newlines. Moreover, the file’s encoding will be interpreted\nbased on your locale settings. The other import formats share none of\nthese limitations.\n\n2.1.2. From .json\n\nThe file must be a JSON file containing one JSON array. Each element of\nthe array represents one document. These elements are JSON objects\ncontaining at least the key text, and any of the optional attributes. If\nprovided, meta must be a JSON object containing user data about the\ndocument.\n\nTherefore an imported JSON file might look like:\n\n    [\n    {\"text\": \"text of first doc\", \"meta\": {\"author\": \"me\", \"DOI\": \"123\"}},\n    {\"text\": \"text of second doc\", \"short_title\": \"doc456\"}\n    ]\n\nMoreover, it is also possible to import annotations together with a new\ndocument, or for a document already in the database.\n\n+-----------------------------------+-----------------------------------+\n| Note                              | Besides of the object format      |\n|                                   | above, labelbuddy also accepts    |\n|                                   | another format, providing one     |\n|                                   | JSON array per document. In this  |\n|                                   | case the first (mandatory)        |\n|                                   | element of the array is the text, |\n|                                   | and the second (optional) one is  |\n|                                   | meta. Other attributes cannot be  |\n|                                   | specified.                        |\n|                                   |                                   |\n|                                   |     [                             |\n|                                   |     [\"text of first doc\", {       |\n|                                   | \"title\": \"doc 1\", \"DOI\": \"123\"}], |\n|                                   |     [\"text of second doc\"]        |\n|                                   |     ]                             |\n+-----------------------------------+-----------------------------------+\n\n2.1.3. From .jsonl\n\nWhen importing a .json file the whole file is read into memory before\ninserting the documents in the database. To read documents one by one\nand reduce memory usage, you can use JSON Lines. It is similar to the\nJSON format, but instead of having one JSON array, the file must contain\none JSON document per line. For example:\n\n    {\"text\": \"text of first doc\", \"meta\": {\"author\": \"me\", \"DOI\": \"123\"}}\n    {\"text\": \"text of second doc\", \"short_title\": \"doc456\"}\n\nNote the outer brackets are removed and the documents are not separated\nby commas. The object representing each document must occupy exactly one\nline, unlike in .json where whitespace is not important.\n\nAs for .json, .jsonl also allows importing annotations.\n\n2.1.4. From .xml\n\nYou can also use a simple XML format. In this case as well, the\ndocuments are read one by one. The root element must be document_set and\ncontain any number of document elements. Each document contains the text\nand any additional information. User metadata is provided in the\nattributes of an element named meta. A document’s children can appear in\nany order.\n\nFor example:\n\n    <?xml version=\"1.0\" encoding=\"UTF-8\"?>\n    <document_set>\n      <document>\n        <text>text of first doc</text>\n        <meta DOI=\"123\" author=\"me\"/>\n      </document>\n      <document>\n        <text>text of second doc</text>\n        <short_title>doc456</short_title>\n      </document>\n    </document_set>\n\nThe same format can be used to import annotations.\n\n2.2. Importing labels\n\nTo import labels, click Import labels in the “Import / Export” tab.\nLabels have three attributes: a mandatory text (label name), and an\noptional color and shortcut_key. The shortcut_key is a lower-case ASCII\nletter (a-z) that helps quickly annotating text with that label.\n\nFor compatibility with doccano, color can also be specified as\nbackground_color and shortcut_key can be specified as suffix_key.\n\nAs for documents, the format is deduced from the filename extension when\nimporting labels. The label color and shortcut key can be changed from\nwithin the GUI application .\n\n2.2.1. From .txt\n\nThe text file contains one label per line. For example:\n\n    Noun\n    Verb\n    Adjective\n\nTo specify a color or shortcut key (or to use labels that contain\nnewlines), use the .json format.\n\n2.2.2. From .json\n\nThe file must contain a JSON array containing one JSON object per label.\n\nEach label’s object must have the key text and optionally color and\nshortcut_key (or their synonyms background_color and suffix_key, which\nhave lower precedence).\n\nFor example:\n\n    [\n    {\"text\": \"Noun\", \"color\": \"#ff0000\"},\n    {\"text\": \"Verb\", \"color\": \"yellow\", \"shortcut_key\": \"v\"},\n    {\"text\": \"Adjective\"}\n    ]\n\n+-----------------------------------+-----------------------------------+\n| Note                              | Besides of the object format      |\n|                                   | above, labelbuddy also accepts    |\n|                                   | another format, providing one     |\n|                                   | JSON array per label. In this     |\n|                                   | case the first (mandatory)        |\n|                                   | element of the array is the text  |\n|                                   | (label name), and the second      |\n|                                   | (optional) one is the color.      |\n|                                   |                                   |\n|                                   |     [                             |\n|                                   |     [\"Noun\", \"#ff0000\"],          |\n|                                   |     [\"Verb\", \"yellow\"],           |\n|                                   |     [\"Adjective\"]                 |\n|                                   |     ]                             |\n+-----------------------------------+-----------------------------------+\n\n2.3. Annotating documents\n\nOnce you have imported labels and documents you can see them in the\n“Dataset” tab. You can delete labels or documents and change the color\nand shortcut associated with each label. You then go to the “Annotate”\ntab. (If you double-click a document it will be opened in the “Annotate”\ntab.)\n\nTo annotate a document, select the region you want to label with the\nmouse and click on the appropriate label. It is also possible to do the\nsame thing with the keyboard. Search for the term you want to annotate\nand the first match will be selected. The selection can be adusted with\nthe keyboard using the bindings described below. Then press the shortcut\nkey associated with the label you want to set.\n\nOnce you have created annotations, you can select any of them by\nclicking it. It becomes bold and underlined and you can change its label\nby clicking on a different one or remove the annotation by clicking\nRemove. You can also do this with the keyboard: jump to the next\nannotation with the Space key and change its label with a label shortcut\nor remove it with Backspace.\n\nIf you create a new annotation that overlaps with a previously existing\none, the previously existing one is automatically removed.\n\n+-----------------------------------+-----------------------------------+\n| Tip                               | If showing the selection in bold  |\n|                                   | is annoying (depending on the     |\n|                                   | font it can slightly change its   |\n|                                   | size) you can disable it in       |\n|                                   | Preferences › Bold selected       |\n|                                   | region.                           |\n+-----------------------------------+-----------------------------------+\n\n2.3.1. Summary of key bindings in the “Annotate” tab\n\n+----------------------+-----------------------------------------------+\n| Searching and        |                                               |\n| navigation           |                                               |\n+======================+===============================================+\n| Ctrl and scroll the  | zoom or dezoom the text                       |\n| mouse                |                                               |\n+----------------------+-----------------------------------------------+\n| Ctrl+F, /            | search                                        |\n+----------------------+-----------------------------------------------+\n| Enter                | next search match                             |\n+----------------------+-----------------------------------------------+\n| Shift+Enter          | previous search match                         |\n+----------------------+-----------------------------------------------+\n| Ctrl+J, Ctrl+N, Down | scroll down one line                          |\n+----------------------+-----------------------------------------------+\n| Ctrl+K, Ctrl+P, Up   | scroll up one line                            |\n+----------------------+-----------------------------------------------+\n| Ctrl+D               | scroll down one page                          |\n+----------------------+-----------------------------------------------+\n| Ctrl+U               | scroll up one page                            |\n+----------------------+-----------------------------------------------+\n| Ctrl+L               | cycle between placing the cursor at the       |\n|                      | center, top and bottom of the window          |\n+----------------------+-----------------------------------------------+\n\n+----------------------+-----------------------------------------------+\n| Manipulating         |                                               |\n| annotations          |                                               |\n+======================+===============================================+\n| a-z (label’s         | set corresponding label for the currently     |\n| shortcut_key)        | selected region or annotation                 |\n+----------------------+-----------------------------------------------+\n| Backspace            | remove selected annotation                    |\n+----------------------+-----------------------------------------------+\n| Space                | jump to next annotation and select it         |\n+----------------------+-----------------------------------------------+\n| Shift+Space          | jump to previous annotation and select it     |\n+----------------------+-----------------------------------------------+\n| Esc                  | un-select selected annotation                 |\n+----------------------+-----------------------------------------------+\n\n+----------------------+-----------------------------------------------+\n| Manipulating the     |                                               |\n| text selection       |                                               |\n+======================+===============================================+\n| ]                    | move the end of the selection by one word to  |\n|                      | the right                                     |\n+----------------------+-----------------------------------------------+\n| [                    | move the end of the selection by one word to  |\n|                      | the left                                      |\n+----------------------+-----------------------------------------------+\n| }                    | move the beginning of the selection by one    |\n|                      | word to the right                             |\n+----------------------+-----------------------------------------------+\n| {                    | move the beginning of the selection by one    |\n|                      | word to the left                              |\n+----------------------+-----------------------------------------------+\n| Ctrl+]               | move the end of the selection by one          |\n|                      | character to the right                        |\n+----------------------+-----------------------------------------------+\n| Ctrl+[               | move the end of the selection by one          |\n|                      | character to the left                         |\n+----------------------+-----------------------------------------------+\n| Ctrl+}               | move the beginning of the selection by one    |\n|                      | character to the right                        |\n+----------------------+-----------------------------------------------+\n| Ctrl+{               | move the beginning of the selection by one    |\n|                      | character to the left                         |\n+----------------------+-----------------------------------------------+\n\n+----------------------+-----------------------------------------------+\n| Navigating documents |                                               |\n+======================+===============================================+\n| >                    | go to next document                           |\n+----------------------+-----------------------------------------------+\n| <                    | go to previous document                       |\n+----------------------+-----------------------------------------------+\n\n2.4. Exporting annotations\n\nOnce you are satisfied with your annotations you can export them to an\n.json, .jsonl or .xml file to share them or use them in other\napplications.\n\nBack in the “Import / Export” tab, click Export docs & annotations. You\ncan choose to export all documents or only those that have annotations.\nYou can choose to export the text of the documents or not. If you don’t\nexport the text, the documents can be identified from metadata you may\nhave associated with them, or by the MD5 checksum of the text that is\nalways exported. You can also provide an “annotation approver” (user\nname), that will be exported as the annotation_approver (used by\ndoccano).\n\nWhen clicking Export docs & annotations you are asked to select a file\nand the resulting format will depend on the filename extension. The\nexport format is the same as the import format. Exported documents and\nannotations can thus be imported back into a labelbuddy database.\n\nCompared to previous description of the import format, in exported\ndocuments:\n\n-   text is optional (you can choose not to export it to save space, in\n    this case documents can be identified from their MD5 checksum or\n    from the user metadata).\n\n-   document_md5_checksum (containing the hex representation of the MD5\n    checksum of the text) and labels (containing the document’s\n    annotations) are added. The optional attribute annotation_approver\n    can also be added.\n\nlabels is a list of annotations, each represented by a triplet of:\n\n  ------------ -----------------------------------------------------------------------------------\n  start_char   the position of the first character (starting from 0 at the begining of the text)\n  end_char     the position of one past the last character\n  label        the label name.\n  ------------ -----------------------------------------------------------------------------------\n\nFor example if the text starts with “hello” and you highlighted exactly\nthat word, and labelled it with label_1, the associated annotation will\nbe [0, 5, \"label_1\"].\n\n+-----------------------------------+-----------------------------------+\n| Note                              | Documents are exported in the     |\n|                                   | same order that they were         |\n|                                   | imported.                         |\n+-----------------------------------+-----------------------------------+\n\n2.4.1. Exporting to .json\n\nJSON exported annotations might look like:\n\n    [\n    {\"annotation_approver\":\"jerome\",\"document_md5_checksum\":\"f5a42de39848dbdadf79aade46135b7a\",\"labels\":[[0,4,\"Noun\"]],\"meta\":{\"DOI\":\"123\",\"author\":\"me\"},\"text\":\"text of first doc\"},\n    {\"annotation_approver\":\"jerome\",\"document_md5_checksum\":\"d5c080bd4c6033f977182e757a0059b1\",\"labels\":[[0,4,\"Verb\"],[8,14,\"Adjective\"]],\"meta\":{}, \"text\":\"text of second doc\", \"short_title\": \"doc456\"}\n    ]\n\nEach document will always be on one separate line; this makes it easy to\nparse the file incrementally. Moreover as the documents are always in\nthe same order, it gives line-oriented tools such as diff or git a\nbetter chance of producing useful output.\n\n2.4.2. Exporting to .jsonl\n\nIf you choose to export to a JSON lines file, the content will be almost\nthe same as the JSON one, but with just one JSON object per line and not\none JSON array containing all the documents:\n\n    {\"annotation_approver\":\"jerome\",\"document_md5_checksum\":\"f5a42de39848dbdadf79aade46135b7a\",\"labels\":[[0,4,\"Noun\"]],\"meta\":{\"DOI\":\"123\",\"author\":\"me\"},\"text\":\"text of first doc\"}\n    {\"annotation_approver\":\"jerome\",\"document_md5_checksum\":\"d5c080bd4c6033f977182e757a0059b1\",\"labels\":[[0,4,\"Verb\"],[8,14,\"Adjective\"]],\"meta\":{}, \"text\":\"text of second doc\", \"short_title\": \"doc456\"}\n\n2.4.3. Exporting to .xml\n\nIf you choose a .xml file the result is a UTF-8 encoded XML document.\nAgain the format is the same as for importing with some additional\nelements (and possibly no text).\n\nSo it may look like:\n\n    <?xml version=\"1.0\" encoding=\"UTF-8\"?>\n    <document_set>\n        <document>\n            <text>text of first doc</text>\n            <document_md5_checksum>f5a42de39848dbdadf79aade46135b7a</document_md5_checksum>\n            <meta DOI=\"123\" author=\"me\"/>\n            <annotation_approver>jerome</annotation_approver>\n            <labels>\n                <annotation>\n                    <start_char>0</start_char>\n                    <end_char>4</end_char>\n                    <label>Noun</label>\n                </annotation>\n            </labels>\n        </document>\n        <document>\n            <text>text of second doc</text>\n            <document_md5_checksum>d5c080bd4c6033f977182e757a0059b1</document_md5_checksum>\n            <meta/>\n            <annotation_approver>jerome</annotation_approver>\n            <short_title>doc456</short_title>\n            <labels>\n                <annotation>\n                    <start_char>0</start_char>\n                    <end_char>4</end_char>\n                    <label>Verb</label>\n                </annotation>\n                <annotation>\n                    <start_char>8</start_char>\n                    <end_char>14</end_char>\n                    <label>Adjective</label>\n                </annotation>\n            </labels>\n        </document>\n    </document_set>\n\n2.5. Exporting labels\n\nYou can also export labels by clicking “Export labels” and selecting a\nJSON file. The resulting file will contain an array of json objects; the\nsame format as the input format. Unlike documents each label is not on a\nsingle line. Both keys color and background_color are set to the label’s\ncolors. Both keys shortcut_key and suffix_key are set to the label’s\nshortcut key if it has one.\n\n2.6. Importing annotations\n\nExported annotations can be imported back into the same or another\nlabelbuddy database. Simply use the Import docs & annotations button and\nselect the exported file. Labels used in the annotations that are not in\nthe database will be added (with an arbitrary color that can be changed\nin the application).\n\nFor documents already in the database, annotations will be imported\nwhether the document’s text was exported together with the annotations\nor not. If the text is not present in the exported file, the MD5\nchecksum will be used to associate the annotations with the correct\ndocument.\n\nTo avoid mixing annotations from different sources, if the document\nalready contains annotations in the database, the new annotations will\nnot be added.\n\nFor documents that are not in the database, their text must have been\nexported together with the annotations and in this case both the\ndocument and the annotations will be added to the database.\n\n2.6.1. Copying annotations to and from doccano\n\nDocuments and annotations exported from doccano can also be imported\ninto a labelbuddy database. To do so, when exporting from doccano select\nthe format “jsonl (text label)”. Make sure to save them in a file with\nthe .jsonl extension (not .json) otherwise labelbuddy will try to parse\nit as JSON and JSON Lines is not valid JSON.\n\n+-----------------------------------+-----------------------------------+\n| Caution                           | doccano strips leading and        |\n|                                   | trailing whitespace from          |\n|                                   | documents when importing them.    |\n|                                   | Therefore if you import the       |\n|                                   | result into a labelbuddy database |\n|                                   | that already contains the         |\n|                                   | original documents, it may not be |\n|                                   | recognized as being the same      |\n|                                   | (labelbuddy doesn’t modify the    |\n|                                   | imported documents) and you might |\n|                                   | end up with (near) duplicate      |\n|                                   | documents in the database.        |\n+-----------------------------------+-----------------------------------+\n\nAnnotations exported from labelbuddy in the .jsonl format together with\nthe document’s text can also be imported into doccano (selecting the\n“jsonl” import format).\n\n+-----------------------------------+-----------------------------------+\n| Caution                           | if the original document          |\n|                                   | contained leading whitespace,     |\n|                                   | labelbuddy annotations will       |\n|                                   | appear shifted when doccano       |\n|                                   | removes the whitespace. Moreover, |\n|                                   | doccano allows duplicate          |\n|                                   | documents so if the documents     |\n|                                   | were already in the doccano       |\n|                                   | database, they will appear as new |\n|                                   | (duplicate) documents rather than |\n|                                   | new annotations for existing      |\n|                                   | documents.                        |\n+-----------------------------------+-----------------------------------+\n\n2.7. Managing projects\n\nEach labelbuddy database (containing documents, labels and annotations)\nis an SQLite database. That is a single binary file on your disk that\nyou can copy, backup, or share, like any other file.\n\n+-----------------------------------+-----------------------------------+\n| Tip                               | Using SQLite you can also open a  |\n|                                   | connection directly to the        |\n|                                   | database to query it or even      |\n|                                   | modify it. If you do so, set      |\n|                                   | PRAGMA foreign_keys = ON.         |\n+-----------------------------------+-----------------------------------+\n\nWhen you first start labelbuddy it creates a new database in\n~/labelbuddy_data.sqlite3. You can switch to a different one by\nselecting File › Open or File › New. The path to the current database is\ndisplayed in the “Import / Export” tab.\n\nThe next time you start labelbuddy, it will open the last database that\nyou opened.\n\nThe database to open can also be specified when invoking labelbuddy from\nthe command line:\n\n    labelbuddy /path/to/my_annotations.sqlite3\n\nIf you just want to give labelbuddy a try and don’t have documents or\nlabels yet, you can also select File › Demo to open a temporary database\npre-loaded with a few examples.\n\nAs it is easy to create and delete databases (an empty labelbuddy\ndatabase is just 48K), and to copy documents, labels and annotations\nfrom one to another, you have some freedom in the organization of\nannotation work. In particular, it is possible to work with several\ndatabases rather than a monolithic one. You can break down the\nannotations into several files to reflect the structure of your project.\nAs an example you could also create a new database to annotate a fresh\nbatch of documents, then export and merge into a main database once that\nbatch is finished.\n\n2.8. Command-line interface\n\nlabelbuddy can also be used from the command line to create databases,\nimport and export documents, labels and annotations without opening the\nGUI. See the labelbuddy(1) man page, or labelbuddy -h for a short list\nof options reproduced here:\n\n    Usage: ./labelbuddy [options] database\n    Annotate documents.\n\n    Options:\n      -h, --help                                 Displays this help.\n      -v, --version                              Displays version information.\n      --demo                                     Open a temporary demo database\n                                                 with pre-loaded docs\n      --import-labels <labels file>              Labels file to import in database.\n      --import-docs <docs file>                  Docs & annotations file to import\n                                                 in database.\n      --export-labels <exported labels file>     Labels file to export to.\n      --export-docs <exported docs file>         Docs & annotations file to export\n                                                 to.\n      --labelled-only                            Export only labelled documents\n      --include-text                             Include doc text with exported\n                                                 annotations\n      --approver <name>                          User or 'annotations approver'\n                                                 name\n      --vacuum                                   Repack database into minimal\n                                                 amount of disk space.\n\n    Arguments:\n      database                                   Database to open.\n\nIf any of the import- or export- options are used, labelbuddy doesn’t\nstart a GUI but performs the required import or export operations and\nexits. It is possible to specify these options several times. To use\nthese options, the database path must be provided explicitly. Labels are\nimported first, then documents, then export operations are performed.\n\nAs an example, to convert a previously exported file docs.xml to JSON\nand strip the documents' text, you could run:\n\n    tmpdb=$(mktemp) && labelbuddy $tmpdb --import-docs docs.xml --export-docs docs.json; rm $tmpdb\n\nRegarding vacuum: when data is deleted from an sqlite3 database, the\nfile doesn’t shrink. The freed up space is not lost; it is kept and\nreused when new data is added to the database. To shrink the database to\noccupy a minimal amount of disk space, we can use:\n\n    labelbuddy --vacuum /path/to/db.sqlite3\n\nor equivalently:\n\n    sqlite3 /path/to/db.sqlite3 'VACUUM;'\n\nSee more details here. When the vacuum option is used, other options are\nignored and labelbuddy shrinks the database then exits without starting\nthe GUI.\n\n3. Conclusion\n\nlabelbuddy was created using C++, Qt, SQLite, tools from the GNU\nproject, and more.\n\nIf you find a bug, kindly open an issue on the labelbuddy GitHub\nrepository.\n\n", "meta": {"title": "documentation.txt", "md5": "70c140cd8530ac34414edf16f042360f"}, "short_title": "labelbuddy documentation — <a href='https://jeromedockes.github.io/labelbuddy/documentation.html'>online version</a>", "long_title": "labelbuddy documentation"}, {"text": "\nExtract from Wikipedia:\nhttps://ar.wikipedia.org/wiki/%D9%84%D8%BA%D8%A9\n\nاللغة هي نسق على من الإشارات والرموز، تشكل أداة من أدوات المعرفة، وتعتبر اللغة أهم وسائل التفاهم والاحتكاك بين أفراد المجتمع في جميع ميادين الحياة.\n\nوبدون اللغة يتعذر نشاط الناس المعرفي. ترتبط اللغة بالتفكير ارتباطًا وثيقًا؛ فأفكار الإنسان تصاغ دومًا في قالب لغوي، حتى في حال تفكيره الباطني. ومن خلال اللغة تحصل الفكرة فقط على وجودها الواقعي. كما ترمز اللغة إلى الأشياء المنعكسة فيها، فاللغة هي القدرة على اكتساب واستخدام نظام معقد للتواصل وخاصة قدرة الإنسان على القيام بذلك، واللغة هي أحد الأمثلة المحددة من هذا النظام، وتسمى الدراسة العلمية للغة بعلم اللغويات.\n\nهناك تساؤلات حول فلسفة اللغة نوقشت من قبل جورجياس وبلاتو في اليونان القديمة مثل ما إذا كان للكلمات يمكن أن تعبر عن خبرة ما، فيقول بعض من المفكرين مثل روسو أن اللغة نشئت من العواطف، بينما آخرون مثل كانت يرى أنها نشئت من التفكير العقلاني والمنطقي، ومن فلاسفة القرن العشرين مثل ويتينستاين قد قال بأن الفلسفة هي حقاً دراسة اللغة، وتشمل الشخصيات الرئيسية في علم اللغويات فرديناند دي سوسير، ونوم نشومسكي، وويليام ستوكيو.\n\nيتفاوت تقدير عدد اللغات في العالم بين 5000 و7000 لغة، ومع ذلك فإن أي تقدير دقيق يعتمد جزئيا على التمييز التعسفي بين اللغات واللهجات، فاللغات الطبيعية تكون إما لغة منطوقة أو لغة الإشارة، ولكن يكن ترميز أي لغة إلى وسائل الإعلام الثانوية باستخدام المنبهات السمعية والبصرية أو اللمسية على سبيل المثال، في الكتابة التصويرية، أو طريقة بريل للمكفوفين، أو الصفير، وهذا لأن لغة الإنسان هي لغة مستقلة. ويمكن لمصطلح \"اللغة\" عندما يستخدم على المفهوم العام أن يرجع إلى القدرة الإدراكية لتعليم واستخدام نظام التواصل المعقد، أو إلى وصف مجموعة من القواعد التي تشكل هذه الأنظمة، أو مجموعة من التصريحات التي يمكن أن تنتج من تلك القواعد اعتمادا على وجهات النظر الفلسفية المتعلقة بتعريف اللغة والمعنى، فتعتمد جميع اللغات على عملية صيرورة العلامات لتشير إلى معاني معينة فتحتوي اللغة المشلفهة أو المنطوقة ولغة الإشارة على نظام صوتي يتحكم بكيفية استخدام الرموز لتشكيل سلاسل تعرف باسم الكلمات أو الصرفية، ونظام نحوي والذي يتحكم بكيفية الجمع بين الكلمات والصرف لتشكل العبارات والأقوال.\n\nلدى لغة الإنسان خصائص عديدة كالإنتاجية، والتكرار، والإزاحة، والتي تعتمد على الاتفاقية الاجتماعية والتعلم. فهي بنية معقدة تتيح الحصول على مجموعة أوسع بكثير من العبارات من أي نظام معروف من التواصل الحيواني، ويعتقد أن اللغة قد نشأت عندما بدأت كائنات شبيهة بالإنسان في وقت مبكر بالتغيير تدريجيا في نظم التواصل الرئيسية، واكتساب القدرة على تشكيل نظرية العقول الأخرى والقصد المشترك، ويعتقد أن هذا التطور في بعض الأحيان قد تزامن مع زيادة في حجم المخ، ويرى الكثير من اللغويين هياكل اللغة بأنها تطورت لتخدم وظائف تواصلية واجتماعية محددة، فتتم معالجة اللغة في العديد من المواقع المختلفة في الدماغ البشري، ولكن خصوصا في مناطق بروكا وفيرنيك، ويكتسب البشر اللغة من خلال التفاعل الاجتماعي في مرحلة الطفولة المبكرة، ويتحدث الأطفال عموما بطلاقة عندما يبلغون ما يقرب الثلاث سنوات من العمر، واستخدام اللغة متأصل في ثقافة الإنسان، بالإضافة إلى استخداماته للتواصل بشكل صارم، وأيضا للغه العديد من الاستخدامات الاجتماعية والثقافية، مثل الدلالة على هوية المجموعة، والطبقات الاجتماعية، وكذلك الاستمالة الاجتماعية والترفيهية.\n\nتتطوراللغات وتتنوع مع مرور الوقت، ويمكن إعادة تاريخ تطورها وبنائها من خلال مقارنة اللغات الحديثة لتحديد سمات لغات أجدادهم التي يجب أن تكون من أجل المراحل التنموية التي يمكن ان تحدث في وقت لاحق، ومن المعروف أن مجموعة من اللغات التي تنحدر من سلف مشترك تندرج كلغة الأسرة مثل عائلة الهندو أوروبية وهي الأكثر انتشارا والتي تشمل لغات عدة مثل الإنجليزية والروسية والهندية، والأسرة بين الصين والتبت، والذي تتضمن الفصحى واللغات الصينية الأخرى، والتبت، وعائلة الأفرو آسيوية، والتي تشمل العربية والصومالية، والعبرية. أيضا لغات البانتو والتي تشمل السواحلية، والزولو، ومئات من اللغات الأخرى المستخدمة في جميع أنحاء أفريقيا. ولغات مالايو-البولينيزية، والتي تشمل الإندونيسية والماليزية والتغالوغ، ومئات من اللغات الأخرى المستخدمة في جميع أنحاء المحيط الهادي. و لغات أسرة درافيديون التي غالبا يتحدث بها جنوب الهند والتي تشمل لغة التاميل والتيلجو. يذهب التوافق الدراسي إلى أن ما بين 50٪ و 90٪ من اللغات التي يتحدث بها في بداية القرن ال21 على وشك أن تنقرض بحلول عام 2100.\n", "meta": {"title": "wikipedia_language_ar.txt", "md5": "2912510120a2fccfdcb04e47d26a5d82"}, "short_title": "<a href=\"https://ar.wikipedia.org/wiki/%D9%84%D8%BA%D8%A9\">لغة</a>", "long_title": "لغة"}, {"text": "\nExtract from Wikipedia:\nhttps://el.wikipedia.org/wiki/%CE%93%CE%BB%CF%8E%CF%83%CF%83%CE%B1\n\nΟ όρος γλώσσα χρησιμοποιείται κυρίως για να αναφερθούμε στον τρόπο επικοινωνίας, ιδίως του ανθρώπου, αλλά μπορεί να αναφέρεται επίσης και σε περιπτώσεις τεχνητών και μη ανθρώπινων σημειακών συστημάτων (μιμόγλωσσα, τυπικές γλώσσες των μαθηματικών και της πληροφορική, γλώσσες προγραμματισμού, συστήματα επικοινωνίας ζώων κ.λπ.).\n\nΗ φυσική διαδικασία απόκτησης μιας γλώσσας, που συμβαίνει κατά τα 4-5 πρώτα χρόνια ζωής του ανθρώπου, αναφέρεται ως μητρική και είναι μέρος της φυσικής εξέλιξης του ανθρώπου. Η γλώσσα γίνεται το απαραίτητο μέσο με το οποίο ο άνθρωπος επικοινωνεί και γνωρίζει το περιβάλλον του. Με μια ολοκληρωμένη γλωσσική αγωγή, ο ομιλητής κάθε γλώσσας είναι σε θέση να συνδυάζει τη γνώση του συστήματος της γλώσσας για την παραγωγή και την πρόσληψη μηνυμάτων.\n\nΠιστεύεται ότι δεν υπάρχει σαφής διαχωριστική γραμμή ανάμεσα στον όρο γλώσσα, με τη σημασία της συγκεκριμένης εθνικής γλώσσας, και στον όρο διάλεκτος. Σύμφωνα με τη διατύπωση του Max Weinrich, «γλώσσα είναι μια διάλεκτος με στρατό και στόλο», ενώ —σύμφωνα με άλλη διατύπωση— «διάλεκτος είναι μια ηττημένη γλώσσα\". Πιθανότατα, «όλες οι γλώσσες του κόσμου, σε όλους τους καιρούς, είναι διάλεκτοι μιας πρώτης κοινής γλώσσας που πριν χιλιάδες χρόνια ήταν παγκόσμια γλώσσα»\n", "meta": {"title": "wikipedia_language_el.txt", "md5": "26e477ca3f55320204f109bb07e79198"}, "short_title": "<a href=\"https://el.wikipedia.org/wiki/%CE%93%CE%BB%CF%8E%CF%83%CF%83%CE%B1\">Γλώσσα</a>", "long_title": "Γλώσσα"}, {"text": "\nExtract from Wikipedia:\nhttps://zh.wikipedia.org/wiki/%E8%AA%9E%E8%A8%80\n\n语言是一类复合交流系统，主要包含其形成、习得、维护及应用，特别是相应的人类能力。某一门语言则是这类系统的具体例子。除了交流溝通外，語言也是一個人的身分認同中主要的構成部分，也是一個文化的主要成分之一。\n\n语言学是对语言的科学研究。语言哲学方面相关的辩论，比如词汇能否能表述经历，至少可追溯至古希腊的高爾吉亞与柏拉图。以卢梭为代表的一些思想家認為語言源自情绪，而康德认为其源于理性和逻辑的思辨。诸如维特根斯坦等20世紀的哲學家论证说哲學实质上就是对語言的研究。著名的语言学家有弗迪南·德·索緒爾、诺姆·乔姆斯基等。\n\n人类语言据估算约有5000到7000种，由于语言与方言的差别难以定义，难以有准确的统计。自然语言常以口述或手語方式表達，但任何語言都可以用聲音（如口哨語）、視覺（如手語）或是觸覺剌激（如盲文）来表现。符號學中将这一现象描述为模态无关（modality-independent）。依照语言哲学對语言与意义的定义，广义上，“语言”可以指代学习并使用该复杂交流系统的认知能力，也可以描述构成这一系统的规则集合，还可以指由语言规则生成（produce）的词句的集合。所有的語言都依靠符号过程來將特定的记号和意义相連結。口语、手語及觸覺語言都有音位學系統來將符號組合成詞或是語素的系統，也有语法学系統來將詞及語素組合成短语和话语。\n\n人類語言具有创造性和移位性，完全靠社會習俗及學習而來。語言的複雜結構使得其可表達的範圍比任何已知的動物交流系統都要廣。依心理學的觀點，語言是起源於人族有了形成心智理論的能力，以及有分享的意向，之後漸漸由其原始的溝通系統演變而來[1][2]。這個發展出現的時期也和人類腦容量擴展的時期大致相同，許多語言學家認為語言的結構有因為一些特定的溝通及社會機能而演變。人腦有許多部份會處理語言，但主要是在布若卡氏区及韦尼克区。人類的语言习得是在童年早期的社會互動中學習的，小孩大約三歲就可以流利的說話了。語言的使用已深深紮根於人類文化之中。因此語言除了用在溝通上，也有許多社會及文化上的用途，例如強化群體身份认同及社會階層，也用來社會性梳理及娛樂。\n\n語言會隨時間演进与分化。其演化歷史可以通过与现代语言的比較來构拟：从现代语言中确定哪些特质是祖语存在的，由此在语言的后续发展阶段得以存续。有共同祖语的一组語言稱為语系。印欧语系的语言在今天为使用人数之最，其主要成员有英语、俄语和印地语。汉藏语系包括汉语诸方言[註 1]、藏语、博多语等。亚非语系包括阿拉伯语、索馬里語及希伯来语。班图语支中有斯瓦希里语、祖鲁语和其他數百種非洲語言。马来－波利尼西亚语族包括印尼语、马来语、他加祿語及数百种遍布太平洋的語言。达罗毗荼语系主要分布于印度南部，其中有泰米尔语和泰卢固语。學術界认为现存口语中有50%至90%會在2100年前滅絕[3]。\n", "meta": {"title": "wikipedia_language_zh.txt", "md5": "5be6d87531d4a1b4a2e70fe4ae0ed111"}, "short_title": "<a href=\"https://zh.wikipedia.org/wiki/%E8%AA%9E%E8%A8%80\">語言</a>", "long_title": "語言"}]