[{"text": "THIS IS A TEMPORARY DATABASE.\n\nIt will disappear when you close the application. This database contains a few documents and labels to allow trying out labelbuddy. You can create annotations, import more documents and labels and export annotations, but the database itself will be removed when labelbuddy exits.\n\n(You don't have to actually read this text, try annotating it instead!)\n\nIf you decide to start a real project you want to keep, select \"File > Open\" and choose a location on your filesystem to create a persistent database.\n\nTime to start annotating documents! Select some text with the mouse and click on one of the labels on the left to annotate it.\n\nOnce you have made annotations you can select any of them by clicking it or cycle through them with the Space key. The selected annotation becomes underlined and you can then change its label or remove it. Groups of overlapping annotations are shown in gray with white text. If you click such a group several times, each of the annotations it contains is selected in turn. (You can make the selected annotation bold by checking a box in the \"Preferences\" menu.)\n\nTo see a summary of the keybindings available in this page, go to \"Help > Keyboard shortcuts\".\n\nAnnotations are inserted in the database as you create them so there is no need for a \"Save\" button.\n\nOnce you are done annotating this document, you can click \"Next\" above to move on to another one.\n\nThe other documents in this database are a few extracts from Wikipedia (https://en.wikipedia.org/wiki/Main_Page) to illustrate using labelbuddy with different languages and writing systems. The documentation in HTML format can be seen by clicking \"Help > Documentation\".\n\nTo see the list of documents, remove documents or labels, or change the labels' colors, go to the \"Dataset\" tab.\n\nTo export your annotations or import more documents or labels, go to the \"Import / Export\" tab.\n\n", "meta": {"title": "hello_annotations.txt", "md5": "1af9a9b4f9310a05d7b559d3e27cf70b"}, "short_title": "Welcome to labelbuddy demo!", "long_title": "Welcome to labelbuddy demo!", "labels": [[313, 316, "Word"], [360, 370, "Mot"], [350, 354, "Palavra"], [874, 936, "In progress"], [881, 892, "كلمة"], [871, 877, "Word"], [934, 938, "詞"]]}, {"text": "\nExtract from Wikipedia:\nhttps://ar.wikipedia.org/wiki/%D9%84%D8%BA%D8%A9\n\nاللغة هي نسق على من الإشارات والرموز، تشكل أداة من أدوات المعرفة، وتعتبر اللغة أهم وسائل التفاهم والاحتكاك بين أفراد المجتمع في جميع ميادين الحياة.\n\nوبدون اللغة يتعذر نشاط الناس المعرفي. ترتبط اللغة بالتفكير ارتباطًا وثيقًا؛ فأفكار الإنسان تصاغ دومًا في قالب لغوي، حتى في حال تفكيره الباطني. ومن خلال اللغة تحصل الفكرة فقط على وجودها الواقعي. كما ترمز اللغة إلى الأشياء المنعكسة فيها، فاللغة هي القدرة على اكتساب واستخدام نظام معقد للتواصل وخاصة قدرة الإنسان على القيام بذلك، واللغة هي أحد الأمثلة المحددة من هذا النظام، وتسمى الدراسة العلمية للغة بعلم اللغويات.\n\nهناك تساؤلات حول فلسفة اللغة نوقشت من قبل جورجياس وبلاتو في اليونان القديمة مثل ما إذا كان للكلمات يمكن أن تعبر عن خبرة ما، فيقول بعض من المفكرين مثل روسو أن اللغة نشئت من العواطف، بينما آخرون مثل كانت يرى أنها نشئت من التفكير العقلاني والمنطقي، ومن فلاسفة القرن العشرين مثل ويتينستاين قد قال بأن الفلسفة هي حقاً دراسة اللغة، وتشمل الشخصيات الرئيسية في علم اللغويات فرديناند دي سوسير، ونوم نشومسكي، وويليام ستوكيو.\n\nيتفاوت تقدير عدد اللغات في العالم بين 5000 و7000 لغة، ومع ذلك فإن أي تقدير دقيق يعتمد جزئيا على التمييز التعسفي بين اللغات واللهجات، فاللغات الطبيعية تكون إما لغة منطوقة أو لغة الإشارة، ولكن يكن ترميز أي لغة إلى وسائل الإعلام الثانوية باستخدام المنبهات السمعية والبصرية أو اللمسية على سبيل المثال، في الكتابة التصويرية، أو طريقة بريل للمكفوفين، أو الصفير، وهذا لأن لغة الإنسان هي لغة مستقلة. ويمكن لمصطلح \"اللغة\" عندما يستخدم على المفهوم العام أن يرجع إلى القدرة الإدراكية لتعليم واستخدام نظام التواصل المعقد، أو إلى وصف مجموعة من القواعد التي تشكل هذه الأنظمة، أو مجموعة من التصريحات التي يمكن أن تنتج من تلك القواعد اعتمادا على وجهات النظر الفلسفية المتعلقة بتعريف اللغة والمعنى، فتعتمد جميع اللغات على عملية صيرورة العلامات لتشير إلى معاني معينة فتحتوي اللغة المشلفهة أو المنطوقة ولغة الإشارة على نظام صوتي يتحكم بكيفية استخدام الرموز لتشكيل سلاسل تعرف باسم الكلمات أو الصرفية، ونظام نحوي والذي يتحكم بكيفية الجمع بين الكلمات والصرف لتشكل العبارات والأقوال.\n\nلدى لغة الإنسان خصائص عديدة كالإنتاجية، والتكرار، والإزاحة، والتي تعتمد على الاتفاقية الاجتماعية والتعلم. فهي بنية معقدة تتيح الحصول على مجموعة أوسع بكثير من العبارات من أي نظام معروف من التواصل الحيواني، ويعتقد أن اللغة قد نشأت عندما بدأت كائنات شبيهة بالإنسان في وقت مبكر بالتغيير تدريجيا في نظم التواصل الرئيسية، واكتساب القدرة على تشكيل نظرية العقول الأخرى والقصد المشترك، ويعتقد أن هذا التطور في بعض الأحيان قد تزامن مع زيادة في حجم المخ، ويرى الكثير من اللغويين هياكل اللغة بأنها تطورت لتخدم وظائف تواصلية واجتماعية محددة، فتتم معالجة اللغة في العديد من المواقع المختلفة في الدماغ البشري، ولكن خصوصا في مناطق بروكا وفيرنيك، ويكتسب البشر اللغة من خلال التفاعل الاجتماعي في مرحلة الطفولة المبكرة، ويتحدث الأطفال عموما بطلاقة عندما يبلغون ما يقرب الثلاث سنوات من العمر، واستخدام اللغة متأصل في ثقافة الإنسان، بالإضافة إلى استخداماته للتواصل بشكل صارم، وأيضا للغه العديد من الاستخدامات الاجتماعية والثقافية، مثل الدلالة على هوية المجموعة، والطبقات الاجتماعية، وكذلك الاستمالة الاجتماعية والترفيهية.\n\nتتطوراللغات وتتنوع مع مرور الوقت، ويمكن إعادة تاريخ تطورها وبنائها من خلال مقارنة اللغات الحديثة لتحديد سمات لغات أجدادهم التي يجب أن تكون من أجل المراحل التنموية التي يمكن ان تحدث في وقت لاحق، ومن المعروف أن مجموعة من اللغات التي تنحدر من سلف مشترك تندرج كلغة الأسرة مثل عائلة الهندو أوروبية وهي الأكثر انتشارا والتي تشمل لغات عدة مثل الإنجليزية والروسية والهندية، والأسرة بين الصين والتبت، والذي تتضمن الفصحى واللغات الصينية الأخرى، والتبت، وعائلة الأفرو آسيوية، والتي تشمل العربية والصومالية، والعبرية. أيضا لغات البانتو والتي تشمل السواحلية، والزولو، ومئات من اللغات الأخرى المستخدمة في جميع أنحاء أفريقيا. ولغات مالايو-البولينيزية، والتي تشمل الإندونيسية والماليزية والتغالوغ، ومئات من اللغات الأخرى المستخدمة في جميع أنحاء المحيط الهادي. و لغات أسرة درافيديون التي غالبا يتحدث بها جنوب الهند والتي تشمل لغة التاميل والتيلجو. يذهب التوافق الدراسي إلى أن ما بين 50٪ و 90٪ من اللغات التي يتحدث بها في بداية القرن ال21 على وشك أن تنقرض بحلول عام 2100.\n", "meta": {"title": "wikipedia_language_ar.txt", "md5": "2912510120a2fccfdcb04e47d26a5d82"}, "short_title": "<a href=\"https://ar.wikipedia.org/wiki/%D9%84%D8%BA%D8%A9\">لغة</a>", "long_title": "لغة", "labels": []}, {"text": "\nExtract from Wikipedia:\nhttps://el.wikipedia.org/wiki/%CE%93%CE%BB%CF%8E%CF%83%CF%83%CE%B1\n\nΟ όρος γλώσσα χρησιμοποιείται κυρίως για να αναφερθούμε στον τρόπο επικοινωνίας, ιδίως του ανθρώπου, αλλά μπορεί να αναφέρεται επίσης και σε περιπτώσεις τεχνητών και μη ανθρώπινων σημειακών συστημάτων (μιμόγλωσσα, τυπικές γλώσσες των μαθηματικών και της πληροφορική, γλώσσες προγραμματισμού, συστήματα επικοινωνίας ζώων κ.λπ.).\n\nΗ φυσική διαδικασία απόκτησης μιας γλώσσας, που συμβαίνει κατά τα 4-5 πρώτα χρόνια ζωής του ανθρώπου, αναφέρεται ως μητρική και είναι μέρος της φυσικής εξέλιξης του ανθρώπου. Η γλώσσα γίνεται το απαραίτητο μέσο με το οποίο ο άνθρωπος επικοινωνεί και γνωρίζει το περιβάλλον του. Με μια ολοκληρωμένη γλωσσική αγωγή, ο ομιλητής κάθε γλώσσας είναι σε θέση να συνδυάζει τη γνώση του συστήματος της γλώσσας για την παραγωγή και την πρόσληψη μηνυμάτων.\n\nΠιστεύεται ότι δεν υπάρχει σαφής διαχωριστική γραμμή ανάμεσα στον όρο γλώσσα, με τη σημασία της συγκεκριμένης εθνικής γλώσσας, και στον όρο διάλεκτος. Σύμφωνα με τη διατύπωση του Max Weinrich, «γλώσσα είναι μια διάλεκτος με στρατό και στόλο», ενώ —σύμφωνα με άλλη διατύπωση— «διάλεκτος είναι μια ηττημένη γλώσσα\". Πιθανότατα, «όλες οι γλώσσες του κόσμου, σε όλους τους καιρούς, είναι διάλεκτοι μιας πρώτης κοινής γλώσσας που πριν χιλιάδες χρόνια ήταν παγκόσμια γλώσσα»\n", "meta": {"title": "wikipedia_language_el.txt", "md5": "26e477ca3f55320204f109bb07e79198"}, "short_title": "<a href=\"https://el.wikipedia.org/wiki/%CE%93%CE%BB%CF%8E%CF%83%CF%83%CE%B1\">Γλώσσα</a>", "long_title": "Γλώσσα", "labels": []}, {"text": "\nExtract from Wikipedia:\nhttps://zh.wikipedia.org/wiki/%E8%AA%9E%E8%A8%80\n\n语言是一类复合交流系统，主要包含其形成、习得、维护及应用，特别是相应的人类能力。某一门语言则是这类系统的具体例子。除了交流溝通外，語言也是一個人的身分認同中主要的構成部分，也是一個文化的主要成分之一。\n\n语言学是对语言的科学研究。语言哲学方面相关的辩论，比如词汇能否能表述经历，至少可追溯至古希腊的高爾吉亞与柏拉图。以卢梭为代表的一些思想家認為語言源自情绪，而康德认为其源于理性和逻辑的思辨。诸如维特根斯坦等20世紀的哲學家论证说哲學实质上就是对語言的研究。著名的语言学家有弗迪南·德·索緒爾、诺姆·乔姆斯基等。\n\n人类语言据估算约有5000到7000种，由于语言与方言的差别难以定义，难以有准确的统计。自然语言常以口述或手語方式表達，但任何語言都可以用聲音（如口哨語）、視覺（如手語）或是觸覺剌激（如盲文）来表现。符號學中将这一现象描述为模态无关（modality-independent）。依照语言哲学對语言与意义的定义，广义上，“语言”可以指代学习并使用该复杂交流系统的认知能力，也可以描述构成这一系统的规则集合，还可以指由语言规则生成（produce）的词句的集合。所有的語言都依靠符号过程來將特定的记号和意义相連結。口语、手語及觸覺語言都有音位學系統來將符號組合成詞或是語素的系統，也有语法学系統來將詞及語素組合成短语和话语。\n\n人類語言具有创造性和移位性，完全靠社會習俗及學習而來。語言的複雜結構使得其可表達的範圍比任何已知的動物交流系統都要廣。依心理學的觀點，語言是起源於人族有了形成心智理論的能力，以及有分享的意向，之後漸漸由其原始的溝通系統演變而來[1][2]。這個發展出現的時期也和人類腦容量擴展的時期大致相同，許多語言學家認為語言的結構有因為一些特定的溝通及社會機能而演變。人腦有許多部份會處理語言，但主要是在布若卡氏区及韦尼克区。人類的语言习得是在童年早期的社會互動中學習的，小孩大約三歲就可以流利的說話了。語言的使用已深深紮根於人類文化之中。因此語言除了用在溝通上，也有許多社會及文化上的用途，例如強化群體身份认同及社會階層，也用來社會性梳理及娛樂。\n\n語言會隨時間演进与分化。其演化歷史可以通过与现代语言的比較來构拟：从现代语言中确定哪些特质是祖语存在的，由此在语言的后续发展阶段得以存续。有共同祖语的一组語言稱為语系。印欧语系的语言在今天为使用人数之最，其主要成员有英语、俄语和印地语。汉藏语系包括汉语诸方言[註 1]、藏语、博多语等。亚非语系包括阿拉伯语、索馬里語及希伯来语。班图语支中有斯瓦希里语、祖鲁语和其他數百種非洲語言。马来－波利尼西亚语族包括印尼语、马来语、他加祿語及数百种遍布太平洋的語言。达罗毗荼语系主要分布于印度南部，其中有泰米尔语和泰卢固语。學術界认为现存口语中有50%至90%會在2100年前滅絕[3]。\n", "meta": {"title": "wikipedia_language_zh.txt", "md5": "5be6d87531d4a1b4a2e70fe4ae0ed111"}, "short_title": "<a href=\"https://zh.wikipedia.org/wiki/%E8%AA%9E%E8%A8%80\">語言</a>", "long_title": "語言", "labels": []}]